<?php
// +------------------------------------------------+
// |http://www.cjango.com                           |
// +------------------------------------------------+
// | 修复BUG不是一朝一夕的事情，等我喝醉了再说吧！  |
// +------------------------------------------------+
// | Author: 小陈叔叔 <Jason.Chen>                  |
// +------------------------------------------------+
return [
    // +----------------------------------------------------------------------
    // | 日志设置
    // +----------------------------------------------------------------------
    'log'              => [
        'type'        => 'trace', // 支持 socket trace file
        // 'path'        => LOG_PATH . MODULE_NAME . DS . date('Y/m') . DS,
        'path'        => LOG_PATH . MODULE_NAME . DS,
        'time_format' => ' c ',
        'file_size'   => 2097152,
    ],
    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'view_replace_str' => [
        '__SELF__' => $_SERVER['REQUEST_URI'],
        '__CDN__'  => '//cdn' . ROOT_DOMAIN . '/',
        '__CSS__'  => '//cdn' . ROOT_DOMAIN . '/' . MODULE_NAME . '/css',
        '__JS__'   => '//cdn' . ROOT_DOMAIN . '/' . MODULE_NAME . '/js',
        '__IMG__'  => '//cdn' . ROOT_DOMAIN . '/' . MODULE_NAME . '/img',
        '__LIB__'  => '//cdn' . ROOT_DOMAIN . '/' . MODULE_NAME . '/lib',
    ],
];
